from ChapterClass import ChapterClass


class ChapterEightClass(ChapterClass):

    def __init__(self):
        dictionary = {'切符 - билет':'きっぷ',
                      '食べ物 - еда':'たべもの',
                      'огурец':'きゅうり',
                      '豆 - бобы':'まめ',
                      'лук':'ねぎ',
                      'картофель':'じゃがいも',
                      '玉ねぎ - репчатый лук':'たまねぎ',
                      '大根 - японская редька':'だいこん',
                      '人参 - морковь':'にんじん',
                      'клубника':'いちご',
                      'персик':'もも',
                      'арбуз':'すいか',
                      'виноград':'ぶどう',
                      'хурма':'かき',
                      '蜜柑 - мандарин':'みかん',
                      'яблоко':'りんご',
                      '牛肉 - говядина':'ぎゅうにく',
                      '鶏肉 - курятина':'とりにく',
                      '豚肉 - свинина':'ぶたにく',
                      '鮭 - лосось':'さけ'}
        super().__init__(dictionary)
