from ChapterClass import ChapterClass


class ChapterJCountClass(ChapterClass):

    def __init__(self):
        dictionary = {'Японское: 1': 'ひとつ',
                      'Японское: 2': 'ふたつ',
                      'Японское: 3': 'みっつ',
                      'Японское: 4': 'よっつ',
                      'Японское: 5': 'いつつ',
                      'Японское: 6': 'むっつ',
                      'Японское: 7': 'ななつ',
                      'Японское: 8': 'やっつ',
                      'Японское: 9': 'ここのつ',
                      'Японское: 10': 'とお',
                      '時 - час': 'じ',
                      '分 - минута': 'ふん',
                      '午後 - после полудня': 'ごご',
                      '午前 - до полудня': 'ごぜん',
                      '半 - половина': 'はん',
                      '20 лет': 'はたち'}
        super().__init__(dictionary)
