from ChapterClass import ChapterClass


class ChapterTwelveClass(ChapterClass):

    def __init__(self):
        dictionary = {'色々 - различный':'いろいろ',
                      '男の人 - мужчина':'おとこのひと',
                      '女の人　- женщина':'おんなのひと',
                      '男の子 - мальчик':'おとこのこ',
                      '女の子 - девочка':'おんなのこ',
                      '犬 - собака':'いぬ',
                      '猫 - кошка':'ねこ',
                      '物 - вещь, предмет':'もの',
                      'всегда':'いつも',
                      'обычно':'たいてい',
                      'иногда':'ときどき',
                      'не очень':'あまり',
                      'совсем нет':'ぜんぜん',
                      'хорошо, часто':'よく',
                      'в целом':'だいたい',
                      'более':'もっと',
                      'уже':'もう',
                      'медленно':'ゆっくり',
                      'много':'たくさん'}
        super().__init__(dictionary)
