from ChapterClass import ChapterClass


class ChapterSixClass(ChapterClass):

    def __init__(self):
        dictionary = {'吸います - дышать, курить':'すいます',
                      '見ます　- смотреть':'みます',
                      '聞きます - слушать, спрашивать':'ききます',
                      '読みます - читать':'よみます',
                      '書きます - писать':'かきます',
                      '買います - покупать':'かいます',
                      '撮ります - снимать фотографию':'とります',
                      'делать':'します',
                      '会います - встречать (кого-то)':'あいます',
                      'ご飯 - еда, вареный рис':'ごはん',
                      '朝ごはん -завтрак':'あさごはん',
                      '昼ご飯 - обед':'ひるごはん',
                      '晩ご飯 - ужин':'ばんごはん',
                      '映画 - кино':'えいが',
                      '卵 - яйцо':'たまご',
                      '肉 - мясо':'にく',
                      '魚 - рыба':'さかな',
                      '野菜 - овощи':'やさい',
                      '果物 - фрукты':'くだもの',
                      'お茶 - зеленый чай':'おちゃ'}
        super().__init__(dictionary)
