from ChapterClass import ChapterClass


class ChapterFourClass(ChapterClass):

    def __init__(self):
        dictionary = {'где (разг.)': 'どこ',
                      'где (вежл.)': 'どちら',
                      '教室　- класс, аудитория': 'きょうしつ',
                      '食堂　- столовая': 'しょくどう',
                      '事務所　- контора, офис': 'じむしょ',
                      '会議室　- зал заседаний': 'かいぎしつ',
                      '受付 - приемная, стойка администрации': 'うけつけ',
                      '部屋 - комната': 'へや',
                      'お手洗い - уборная': 'おてあらい',
                      '階段 - лестница': 'かいだん',
                      'お国 - страна': 'おくに',
                      '会社 - компания': 'かいしゃ',
                      '家 - дом': 'うち',
                      '電話　- телефон': 'でんわ',
                      '靴 - обувь': 'くつ',
                      '煙草 - табак': 'たばこ',
                      '売り場 - отдел, прилавок (в магазине)': 'うりば',
                      '地下 - подвал': 'ちか',
                      '円 - иена': 'えん',
                      'сколько стоит': 'いくら',
                      'извините': 'すみません',
                      '中国 - КНР': 'ちゅうごく'}
        super().__init__(dictionary)
