from ChapterClass import ChapterClass


class ChapterFourClass(ChapterClass):

    def __init__(self):
        dictionary = {'извините': 'すみません',
                      '中国 - КНР': 'ちゅうごく',
                      '起きます - просыпаться, вставать': 'おきます',
                      '寝ます - спать': 'ねます',
                      '働きます - работать': 'はたらきます',
                      '休みます - отдыхать': 'やすみます',
                      '勉強します - учиться': 'べんきょうします',
                      '終わります - заканчиваться': 'おわります',
                      '銀行 - банк': 'ぎんこう',
                      '郵便局 - почтовое отделение': 'ゆうびんきょく',
                      '図書館 - библиотека': 'としょかん',
                      '美術館　- музей': 'びじゅつかん',
                      '今 - сейчас': 'いま',
                      '半 - половина': 'はん',
                      '何時 - сколько времени': 'なんじ',
                      '何分 - сколько минут': 'なんぷん',
                      '午前 - первая половина дня': 'ごぜん',
                      '午後 - вторая половина дня': 'ごご',
                      '朝 - утро': 'あさ',
                      '昼 - середина дня': 'ひる'}
        super().__init__(dictionary)
