from ChapterClass import ChapterClass


class ChapterTwoClass(ChapterClass):

    def __init__(self):
        dictionary = {'本 - книга': 'ほん',
                      '辞書 - словарь': 'じしょ',
                      '雑誌 - журнал': 'ざっし',
                      '新聞 - газета': 'しんぶん',
                      '手帳 - записная книжка': 'てちょう',
                      '名刺 - визитка': 'めいし',
                      '鉛筆 - карандаш': 'えんぴつ',
                      'ключи': 'かぎ',
                      '時計 - часы': 'とけい',
                      '傘 - зонт': 'かさ',
                      'портфель, сумка': 'かばん',
                      '自動車 - автомобиль': 'じどうしゃ',
                      '机 - стол': 'つくえ',
                      'стул': 'いす',
                      '英語 - английский язык': 'えいご',
                      '日本語 - японский язык': 'にほんご',
                      '～語 - ~ язык': 'ご',
                      '何 - что': 'なに',
                      '電気 - электричество': 'でんき',
                      'так': 'そう'}
        super().__init__(dictionary)
